src/test/resources/com/cardinity/model/pending_payment_v2.json

{
  "id": "8e037fbb-fe5b-4781-b109-b3e93d5f2c0d",
  "amount": "20.00",
  "currency": "EUR",
  "created": "2014-12-17T09:43:31.123Z",
  "type": "authorization",
  "live": false,
  "status": "pending",
  "order_id": "1234567",
  "description": "some description",
  "country": "LT",
  "payment_method": "card",
  "payment_instrument": {
    "card_brand": "Visa",
    "pan": "4447",
    "exp_year": 2017,
    "exp_month": 5,
    "holder": "John Smith"
  },
  "threeds2_data": {
    "acs_url": "https://authorization.url/3ds2/auth",
    "creq": "34uifnui3n4fio3fo3"
  }
}